In [41]:
import pandas as pd

In [42]:
# get the 2019 url WA school ranking
rank_2019 = "https://bettereducation.com.au/school/secondary/wa/wa_top_secondary_schools.aspx?yr=2019"

# Use panda's `read_html` to parse the s1 url
hs_wa_2019 = pd.read_html(rank_2019, header=0)[0]

# insert a column 'year' with values of '2019'
hs_wa_2019.insert(1, 'Year', 2019)

# insert a column 'Rank' with values of incremental values'
hs_wa_2019.insert(2, 'Rank', range(1, 1 + len(hs_wa_2019)))
hs_wa_2019

,School,Year,Rank,Postcode,State Overall Score,English,Maths,Total Enrolments,Trend / Compare,Sector,ICSEA
0,Perth Modern School,2019,1,6008,100,NaN,NaN,1418,Trend / Compare,Government,1239.0
1,"St Hilda's Anglican School for Girls (Inc),Mos...",2019,2,6012,100,NaN,NaN,1087,Trend / Compare,Non-government,1197.0
2,Christ Church Grammar School,2019,3,6010,100,NaN,NaN,1646,Trend / Compare,Non-government,1180.0
3,Rossmoyne Senior High School,2019,4,6148,100,NaN,NaN,2188,Trend / Compare,Government,1121.0
4,"St Mary's Anglican Girls' School (Inc),Karriny...",2019,5,6018,100,NaN,NaN,1414,Trend / Compare,Non-government,1158.0
...,...,...,...,...,...,...,...,...,...,...,...
89,"Swan Valley Anglican Community School,Aveley,W...",2019,90,6069,90,NaN,NaN,1031,Trend / Compare,Non-government,1045.0
90,Boyup Brook District High School,2019,91,6244,90,NaN,NaN,162,Trend / Compare,Government,1002.0
91,"Mater Dei College,Edgewater,WA,6027",2019,92,6027,90,NaN,NaN,804,Trend / Compare,Non-government,1055.0
92,"Emmanuel Catholic College,Beeliar,WA,6164",2019,93,6164,90,NaN,NaN,1061,Trend / Compare,Non-government,1036.0
93,Emmanuel Christian Community School,2019,94,6064,90,NaN,NaN,552,Trend / Compare,Non-government,980.0

In [43]:
# check islamic school College
hs_wa_2019[hs_wa_2019['School'].str.match("Australian Islamic")]

,School,Year,Rank,Postcode,State Overall Score,English,Maths,Total Enrolments,Trend / Compare,Sector,ICSEA
63,"Australian Islamic College (Kewdale),Kewdale,W...",2019,64,6105,93,NaN,NaN,735,Trend / Compare,Non-government,985.0
87,"Australian Islamic College (Thornlie),Thornlie...",2019,88,6108,91,NaN,NaN,1416,Trend / Compare,Non-government,993.0

In [44]:
# replace some values to correct the spelling
hs_wa_2019["School"].replace({"Australian Islamic College (Kewdale),Kewdale,WA,6105": "Australian Islamic College - Kewdale",
                              "Australian Islamic College (Thornlie),Thornlie,WA,6108": "Australian Islamic College - Thornlie"
                                    }, inplace=True)

In [45]:
# Remove other strings after decimal to show only the school name
hs_wa_2019["ICSEA"] = hs_wa_2019["ICSEA"].astype(str)

# Remove other strings after decimal to show only the school name
hs_wa_2019["ICSEA"] = hs_wa_2019["ICSEA"].str.split('.', 1).str.get(0)
hs_wa_2019

,School,Year,Rank,Postcode,State Overall Score,English,Maths,Total Enrolments,Trend / Compare,Sector,ICSEA
0,Perth Modern School,2019,1,6008,100,NaN,NaN,1418,Trend / Compare,Government,1239
1,"St Hilda's Anglican School for Girls (Inc),Mos...",2019,2,6012,100,NaN,NaN,1087,Trend / Compare,Non-government,1197
2,Christ Church Grammar School,2019,3,6010,100,NaN,NaN,1646,Trend / Compare,Non-government,1180
3,Rossmoyne Senior High School,2019,4,6148,100,NaN,NaN,2188,Trend / Compare,Government,1121
4,"St Mary's Anglican Girls' School (Inc),Karriny...",2019,5,6018,100,NaN,NaN,1414,Trend / Compare,Non-government,1158
...,...,...,...,...,...,...,...,...,...,...,...
89,"Swan Valley Anglican Community School,Aveley,W...",2019,90,6069,90,NaN,NaN,1031,Trend / Compare,Non-government,1045
90,Boyup Brook District High School,2019,91,6244,90,NaN,NaN,162,Trend / Compare,Government,1002
91,"Mater Dei College,Edgewater,WA,6027",2019,92,6027,90,NaN,NaN,804,Trend / Compare,Non-government,1055
92,"Emmanuel Catholic College,Beeliar,WA,6164",2019,93,6164,90,NaN,NaN,1061,Trend / Compare,Non-government,1036
93,Emmanuel Christian Community School,2019,94,6064,90,NaN,NaN,552,Trend / Compare,Non-government,980

In [46]:
# Remove other strings after a comma to show only the school name
hs_wa_2019["School"] = hs_wa_2019["School"].str.split(',', 1).str.get(0)
hs_wa_2019

,School,Year,Rank,Postcode,State Overall Score,English,Maths,Total Enrolments,Trend / Compare,Sector,ICSEA
0,Perth Modern School,2019,1,6008,100,NaN,NaN,1418,Trend / Compare,Government,1239
1,St Hilda's Anglican School for Girls (Inc),2019,2,6012,100,NaN,NaN,1087,Trend / Compare,Non-government,1197
2,Christ Church Grammar School,2019,3,6010,100,NaN,NaN,1646,Trend / Compare,Non-government,1180
3,Rossmoyne Senior High School,2019,4,6148,100,NaN,NaN,2188,Trend / Compare,Government,1121
4,St Mary's Anglican Girls' School (Inc),2019,5,6018,100,NaN,NaN,1414,Trend / Compare,Non-government,1158
...,...,...,...,...,...,...,...,...,...,...,...
89,Swan Valley Anglican Community School,2019,90,6069,90,NaN,NaN,1031,Trend / Compare,Non-government,1045
90,Boyup Brook District High School,2019,91,6244,90,NaN,NaN,162,Trend / Compare,Government,1002
91,Mater Dei College,2019,92,6027,90,NaN,NaN,804,Trend / Compare,Non-government,1055
92,Emmanuel Catholic College,2019,93,6164,90,NaN,NaN,1061,Trend / Compare,Non-government,1036
93,Emmanuel Christian Community School,2019,94,6064,90,NaN,NaN,552,Trend / Compare,Non-government,980

In [47]:
# Remove the space and parenthesis strings to show only the school name
hs_wa_2019["School"] = hs_wa_2019["School"].str.split('\s+\(', 1).str.get(0)
hs_wa_2019

,School,Year,Rank,Postcode,State Overall Score,English,Maths,Total Enrolments,Trend / Compare,Sector,ICSEA
0,Perth Modern School,2019,1,6008,100,NaN,NaN,1418,Trend / Compare,Government,1239
1,St Hilda's Anglican School for Girls,2019,2,6012,100,NaN,NaN,1087,Trend / Compare,Non-government,1197
2,Christ Church Grammar School,2019,3,6010,100,NaN,NaN,1646,Trend / Compare,Non-government,1180
3,Rossmoyne Senior High School,2019,4,6148,100,NaN,NaN,2188,Trend / Compare,Government,1121
4,St Mary's Anglican Girls' School,2019,5,6018,100,NaN,NaN,1414,Trend / Compare,Non-government,1158
...,...,...,...,...,...,...,...,...,...,...,...
89,Swan Valley Anglican Community School,2019,90,6069,90,NaN,NaN,1031,Trend / Compare,Non-government,1045
90,Boyup Brook District High School,2019,91,6244,90,NaN,NaN,162,Trend / Compare,Government,1002
91,Mater Dei College,2019,92,6027,90,NaN,NaN,804,Trend / Compare,Non-government,1055
92,Emmanuel Catholic College,2019,93,6164,90,NaN,NaN,1061,Trend / Compare,Non-government,1036
93,Emmanuel Christian Community School,2019,94,6064,90,NaN,NaN,552,Trend / Compare,Non-government,980

In [48]:
# remove other columns
hs_wa_2019 = hs_wa_2019[['School', 'Year', 'Rank', 'Postcode','State Overall Score', 'Total Enrolments', 'ICSEA']]
hs_wa_2019

,School,Year,Rank,Postcode,State Overall Score,Total Enrolments,ICSEA
0,Perth Modern School,2019,1,6008,100,1418,1239
1,St Hilda's Anglican School for Girls,2019,2,6012,100,1087,1197
2,Christ Church Grammar School,2019,3,6010,100,1646,1180
3,Rossmoyne Senior High School,2019,4,6148,100,2188,1121
4,St Mary's Anglican Girls' School,2019,5,6018,100,1414,1158
...,...,...,...,...,...,...,...
89,Swan Valley Anglican Community School,2019,90,6069,90,1031,1045
90,Boyup Brook District High School,2019,91,6244,90,162,1002
91,Mater Dei College,2019,92,6027,90,804,1055
92,Emmanuel Catholic College,2019,93,6164,90,1061,1036
93,Emmanuel Christian Community School,2019,94,6064,90,552,980

In [49]:
# replace some values to correct the spelling
hs_wa_2019["School"].replace({"John Curtin College Of The Arts": "John Curtin College of the Arts", 
                       "Australian Christian College": "Australian Christian College - Southlands",
                       "St Stephen's School": "St Stephen's School - Duncraig",
                       "Schools Of Isolated & Distance Education": "School of Isolated and Distance Education",
                       "St Mary MacKillop College": "St Mary Mackillop College"
                        }, inplace=True)

In [50]:
hs_wa_2019[hs_wa_2019['School'].str.match("Wood")]

,School,Year,Rank,Postcode,State Overall Score,Total Enrolments,ICSEA
34,Woodthorpe School,2019,35,6155,96,255,nan
73,Woodvale Secondary College,2019,74,6026,92,1418,1064

In [51]:
# read school_coordinates csv file
school_coord = pd.read_csv("Resources/school_coordinates.csv")
school_coord

                                         School   Longitude   Latitude
0                      Adam Road Primary School  115.635371 -33.357951
1                     Al-Hidayah Islamic School  115.911564 -32.010358
2                 Albany Community Kindergarten  117.880987 -35.021460
3                         Albany Primary School  117.891611 -35.018212
4     Albany Secondary Education Support Centre  117.866867 -34.990749
...                                         ...         ...        ...
1135                      Yuluma Primary School  115.789990 -31.892268
1136                        Yuna Primary School  115.002648 -28.326566
1137                          Woodthorpe School  115.901720 -32.056540
1138             St Stephen's School - Carramar  115.788280 -31.717040
1139                 Bunbury John Calvin School  115.649560 -33.350970

[1140 rows x 3 columns]

In [52]:
# merge hs_wa_2019 with school_coord
hs_wa_2019_coord = pd.merge(hs_wa_2019, school_coord , on=['School'], how='left')
hs_wa_2019_coord

,School,Year,Rank,Postcode,State Overall Score,Total Enrolments,ICSEA,Longitude,Latitude
0,Perth Modern School,2019,1,6008,100,1418,1239,115.836396,-31.945066
1,St Hilda's Anglican School for Girls,2019,2,6012,100,1087,1197,115.767812,-32.005047
2,Christ Church Grammar School,2019,3,6010,100,1646,1180,115.776987,-31.985461
3,Rossmoyne Senior High School,2019,4,6148,100,2188,1121,115.870546,-32.046265
4,St Mary's Anglican Girls' School,2019,5,6018,100,1414,1158,115.766244,-31.876971
...,...,...,...,...,...,...,...,...,...
89,Swan Valley Anglican Community School,2019,90,6069,90,1031,1045,115.985452,-31.794345
90,Boyup Brook District High School,2019,91,6244,90,162,1002,116.391338,-33.836347
91,Mater Dei College,2019,92,6027,90,804,1055,115.776519,-31.764660
92,Emmanuel Catholic College,2019,93,6164,90,1061,1036,115.840070,-32.128578
93,Emmanuel Christian Community School,2019,94,6064,90,552,980,115.848262,-31.846204

In [53]:
# Check for NaN values
# creating bool series True for NaN values  
bool_series = pd.isnull(hs_wa_2019_coord["Longitude"])  
    
# filtering data  
# displaying data only with Gender = NaN  
hs_wa_2019_coord[bool_series]

Empty DataFrame
Columns: [School, Year, Rank, Postcode, State Overall Score, Total Enrolments, ICSEA, Longitude, Latitude]
Index: []

In [54]:
# read sectors csv file
sectors = pd.read_csv("Resources/sectors.csv")
sectors

                              School          Sector Gender   Religion
0                   Mercedes College  Non-government  Girls   Catholic
1                     Wesley College  Non-government   Boys  Christian
2                    Penrhos College  Non-government  Girls    Uniting
3                     Newman College  Non-government  Co-ed   Catholic
4                 St Norbert College  Non-government  Co-ed   Catholic
..                               ...             ...    ...        ...
188  Bruce Rock District High School      Government  Co-ed    Secular
189                 Shark Bay School      Government  Co-ed    Secular
190   Pemberton District High School      Government  Co-ed    Secular
191       Bunbury John Calvin School  Non-government  Co-ed  Christian
192     Exmouth District High School      Government  Co-ed    Secular

[193 rows x 4 columns]

In [55]:
# merge wa_hs_ratings_icsea with sectors
wa_hs_icsea_2019 = pd.merge(hs_wa_2019_coord, sectors , on=['School'], how='left')
wa_hs_icsea_2019

,School,Year,Rank,Postcode,State Overall Score,Total Enrolments,ICSEA,Longitude,Latitude,Sector,Gender,Religion
0,Perth Modern School,2019,1,6008,100,1418,1239,115.836396,-31.945066,Government,Co-ed,Secular
1,St Hilda's Anglican School for Girls,2019,2,6012,100,1087,1197,115.767812,-32.005047,Non-government,Girls,Anglican
2,Christ Church Grammar School,2019,3,6010,100,1646,1180,115.776987,-31.985461,Non-government,Boys,Anglican
3,Rossmoyne Senior High School,2019,4,6148,100,2188,1121,115.870546,-32.046265,Government,Co-ed,Secular
4,St Mary's Anglican Girls' School,2019,5,6018,100,1414,1158,115.766244,-31.876971,Non-government,Girls,Anglican
...,...,...,...,...,...,...,...,...,...,...,...,...
89,Swan Valley Anglican Community School,2019,90,6069,90,1031,1045,115.985452,-31.794345,Non-government,Co-ed,Anglican
90,Boyup Brook District High School,2019,91,6244,90,162,1002,116.391338,-33.836347,Government,Co-ed,Secular
91,Mater Dei College,2019,92,6027,90,804,1055,115.776519,-31.764660,Non-government,Co-ed,Catholic
92,Emmanuel Catholic College,2019,93,6164,90,1061,1036,115.840070,-32.128578,Non-government,Co-ed,Catholic
93,Emmanuel Christian Community School,2019,94,6064,90,552,980,115.848262,-31.846204,Non-government,Co-ed,Christian

In [56]:
# Check for NaN values
# creating bool series True for NaN values  
bool_series = pd.isnull(wa_hs_icsea_2019["Sector"])  
    
# filtering data  
# displaying data only with Gender = NaN  
wa_hs_icsea_2019[bool_series]

Empty DataFrame
Columns: [School, Year, Rank, Postcode, State Overall Score, Total Enrolments, ICSEA, Longitude, Latitude, Sector, Gender, Religion]
Index: []

In [57]:
# check for "nan" values (known value in the dataset)
wa_hs_icsea_2019.loc[wa_hs_icsea_2019["ICSEA"] == "nan", :]

,School,Year,Rank,Postcode,State Overall Score,Total Enrolments,ICSEA,Longitude,Latitude,Sector,Gender,Religion
34,Woodthorpe School,2019,35,6155,96,255,nan,115.90172,-32.05654,Non-government,Co-ed,Brethren Christian

In [58]:
# replaced nan with 983
wa_hs_icsea_2019 = wa_hs_icsea_2019.replace('nan', 983)

In [59]:
# check for "nan" values (known value in the dataset)
wa_hs_icsea_2019.loc[wa_hs_icsea_2019["ICSEA"] == "nan", :]

Empty DataFrame
Columns: [School, Year, Rank, Postcode, State Overall Score, Total Enrolments, ICSEA, Longitude, Latitude, Sector, Gender, Religion]
Index: []

In [60]:
# save the wa_hs_icsea_2019 dataframe to a CSV file
wa_hs_icsea_2019.to_csv("Resources/wa_hs_icsea_2019.csv", index = False)

In [61]:
# get the 2018 url WA school ranking
rank_2018 = "https://bettereducation.com.au/school/secondary/wa/wa_top_secondary_schools.aspx?yr=2018"

# Use panda's `read_html` to parse the s1 url
hs_wa_2018 = pd.read_html(rank_2018, header=0)[0]

# insert a column 'year' with values of '2018'
hs_wa_2018.insert(1, 'Year', 2018)

# insert a column 'Rank' with values of incremental values'
hs_wa_2018.insert(2, 'Rank', range(1, 1 + len(hs_wa_2018)))


# replace some values to correct the spelling
hs_wa_2018["School"].replace({"Australian Islamic College (Kewdale),Kewdale,WA,6105": "Australian Islamic College - Kewdale"}, inplace=True)

# Remove other strings after a comma to show only the school name
hs_wa_2018["School"] = hs_wa_2018["School"].str.split(',', 1).str.get(0)

# Remove the space and parenthesis strings to show only the school name
hs_wa_2018["School"] = hs_wa_2018["School"].str.split('\s+\(', 1).str.get(0)

# remove other columns
hs_wa_2018 = hs_wa_2018[['School', 'Year', 'Rank', 'Postcode','State Overall Score', 'Total Enrolments']]
hs_wa_2018

,School,Year,Rank,Postcode,State Overall Score,Total Enrolments
0,Perth Modern School,2018,1,6008,100,1411
1,Christ Church Grammar School,2018,2,6010,100,1644
2,Hale School,2018,3,6019,100,1504
3,Rossmoyne Senior High School,2018,4,6148,100,2122
4,St Hilda's Anglican School for Girls,2018,5,6012,100,1121
...,...,...,...,...,...,...
88,Mandurah Baptist College,2018,89,6180,90,1174
89,Ashdale Secondary College,2018,90,6065,90,1597
90,St Mary MacKillop College,2018,91,6280,90,1326
91,John Wollaston Anglican Community School,2018,92,6111,90,897
92,Bunbury Catholic College,2018,93,6230,90,1415

In [62]:
# replace some values to correct the spelling
hs_wa_2018["School"].replace({"John Curtin College Of The Arts": "John Curtin College of the Arts", 
                       "Australian Christian College": "Australian Christian College - Southlands",
                       "St Stephen's School": "St Stephen's School - Duncraig",
                       "Schools Of Isolated & Distance Education": "School of Isolated and Distance Education",
                       "St Mary MacKillop College": "St Mary Mackillop College"
                        }, inplace=True)

In [63]:
# read icsea_full csv file (2018 down to 2016 has no ICSEA values)
icsea_full = pd.read_csv("Resources/icsea_full.csv")
icsea_full

                                       School  ICSEA
0                         Perth Modern School   1239
1        St Hilda's Anglican School for Girls   1197
2                Christ Church Grammar School   1180
3                Rossmoyne Senior High School   1121
4            St Mary's Anglican Girls' School   1158
..                                        ...    ...
108              Exmouth District High School   1016
109                    Seton Catholic College   1038
110                  Mandurah Baptist College   1051
111  John Wollaston Anglican Community School   1054
112                Bunbury Senior High School   1019

[113 rows x 2 columns]

In [64]:
# merge hs_wa_2018 with icsea_full
hs_wa_2018_merge = pd.merge(hs_wa_2018, icsea_full , on=['School'], how='left')
hs_wa_2018_merge

,School,Year,Rank,Postcode,State Overall Score,Total Enrolments,ICSEA
0,Perth Modern School,2018,1,6008,100,1411,1239
1,Christ Church Grammar School,2018,2,6010,100,1644,1180
2,Hale School,2018,3,6019,100,1504,1165
3,Rossmoyne Senior High School,2018,4,6148,100,2122,1121
4,St Hilda's Anglican School for Girls,2018,5,6012,100,1121,1197
...,...,...,...,...,...,...,...
88,Mandurah Baptist College,2018,89,6180,90,1174,1051
89,Ashdale Secondary College,2018,90,6065,90,1597,1030
90,St Mary Mackillop College,2018,91,6280,90,1326,1045
91,John Wollaston Anglican Community School,2018,92,6111,90,897,1054
92,Bunbury Catholic College,2018,93,6230,90,1415,1035

In [65]:
# Check for NaN values
# creating bool series True for NaN values  
bool_series = pd.isnull(hs_wa_2018_merge["ICSEA"])  
    
# filtering data  
# displaying data only with Gender = NaN  
hs_wa_2018_merge[bool_series]

Empty DataFrame
Columns: [School, Year, Rank, Postcode, State Overall Score, Total Enrolments, ICSEA]
Index: []

In [66]:
# merge hs_wa_2018_merge with school_coord
hs_wa_2018_coord = pd.merge(hs_wa_2018_merge, school_coord , on=['School'], how='left')
hs_wa_2018_coord

,School,Year,Rank,Postcode,State Overall Score,Total Enrolments,ICSEA,Longitude,Latitude
0,Perth Modern School,2018,1,6008,100,1411,1239,115.836396,-31.945066
1,Christ Church Grammar School,2018,2,6010,100,1644,1180,115.776987,-31.985461
2,Hale School,2018,3,6019,100,1504,1165,115.783783,-31.912322
3,Rossmoyne Senior High School,2018,4,6148,100,2122,1121,115.870546,-32.046265
4,St Hilda's Anglican School for Girls,2018,5,6012,100,1121,1197,115.767812,-32.005047
...,...,...,...,...,...,...,...,...,...
88,Mandurah Baptist College,2018,89,6180,90,1174,1051,115.760118,-32.478307
89,Ashdale Secondary College,2018,90,6065,90,1597,1030,115.841495,-31.811623
90,St Mary Mackillop College,2018,91,6280,90,1326,1045,115.330251,-33.662607
91,John Wollaston Anglican Community School,2018,92,6111,90,897,1054,116.007834,-32.104726
92,Bunbury Catholic College,2018,93,6230,90,1415,1035,115.661424,-33.343422

In [67]:
# Check for NaN values
# creating bool series True for NaN values  
bool_series = pd.isnull(hs_wa_2018_coord["Longitude"])  
    
# filtering data  
# displaying data only with Gender = NaN  
hs_wa_2018_coord[bool_series]

Empty DataFrame
Columns: [School, Year, Rank, Postcode, State Overall Score, Total Enrolments, ICSEA, Longitude, Latitude]
Index: []

In [68]:
# merge hs_wa_2018_coord with sectors
wa_hs_icsea_2018 = pd.merge(hs_wa_2018_coord, sectors , on=['School'], how='left')
wa_hs_icsea_2018

,School,Year,Rank,Postcode,State Overall Score,Total Enrolments,ICSEA,Longitude,Latitude,Sector,Gender,Religion
0,Perth Modern School,2018,1,6008,100,1411,1239,115.836396,-31.945066,Government,Co-ed,Secular
1,Christ Church Grammar School,2018,2,6010,100,1644,1180,115.776987,-31.985461,Non-government,Boys,Anglican
2,Hale School,2018,3,6019,100,1504,1165,115.783783,-31.912322,Non-government,Boys,Anglican
3,Rossmoyne Senior High School,2018,4,6148,100,2122,1121,115.870546,-32.046265,Government,Co-ed,Secular
4,St Hilda's Anglican School for Girls,2018,5,6012,100,1121,1197,115.767812,-32.005047,Non-government,Girls,Anglican
...,...,...,...,...,...,...,...,...,...,...,...,...
88,Mandurah Baptist College,2018,89,6180,90,1174,1051,115.760118,-32.478307,Non-government,Co-ed,Baptist
89,Ashdale Secondary College,2018,90,6065,90,1597,1030,115.841495,-31.811623,Government,Co-ed,Secular
90,St Mary Mackillop College,2018,91,6280,90,1326,1045,115.330251,-33.662607,Non-government,Co-ed,Catholic
91,John Wollaston Anglican Community School,2018,92,6111,90,897,1054,116.007834,-32.104726,Non-government,Co-ed,Anglican
92,Bunbury Catholic College,2018,93,6230,90,1415,1035,115.661424,-33.343422,Non-government,Co-ed,Catholic

In [69]:
# save the wa_hs_icsea_2018 dataframe to a CSV file
wa_hs_icsea_2018.to_csv("Resources/wa_hs_icsea_2018.csv", index = False)

In [70]:
# get the 2017 url WA school ranking
rank_2017 = "https://bettereducation.com.au/school/secondary/wa/wa_top_secondary_schools.aspx?yr=2017"

# Use panda's `read_html` to parse the s1 url
hs_wa_2017 = pd.read_html(rank_2017, header=0)[0]

# insert a column 'year' with values of '2017'
hs_wa_2017.insert(1, 'Year', 2017)

# insert a column 'Rank' with values of incremental values'
hs_wa_2017.insert(2, 'Rank', range(1, 1 + len(hs_wa_2017)))

# replace some values to correct the spelling
hs_wa_2017["School"].replace({"Australian Islamic College,Dianella,WA,6059": "Australian Islamic College - Dianella"}, inplace=True)

# Remove other strings after a comma to show only the school name
hs_wa_2017["School"] = hs_wa_2017["School"].str.split(',', 1).str.get(0)

# Remove the space and parenthesis strings to show only the school name
hs_wa_2017["School"] = hs_wa_2017["School"].str.split('\s+\(', 1).str.get(0)

# remove other columns
hs_wa_2017 = hs_wa_2017[['School', 'Year', 'Rank', 'Postcode','State Overall Score', 'Total Enrolments']]
hs_wa_2017

,School,Year,Rank,Postcode,State Overall Score,Total Enrolments
0,Perth Modern School,2017,1,6008,100,1371
1,International School of Western Australia,2017,2,6015,100,270
2,Hale School,2017,3,6019,100,1489
3,Methodist Ladies' College,2017,4,6010,100,1151
4,Christ Church Grammar School,2017,5,6010,100,1651
...,...,...,...,...,...,...
84,Bruce Rock District High School,2017,85,6418,90,142
85,Ashdale Secondary College,2017,86,6065,90,1536
86,St Mary MacKillop College,2017,87,6280,90,1252
87,Ellenbrook Christian College,2017,88,6069,90,553
88,Margaret River Senior High School,2017,89,6285,90,991

In [71]:
# replace some values to correct the spelling
hs_wa_2017["School"].replace({"John Curtin College Of The Arts": "John Curtin College of the Arts", 
                       "Australian Christian College": "Australian Christian College - Southlands",
                       "St Stephen's School": "St Stephen's School - Duncraig",
                       "Schools Of Isolated & Distance Education": "School of Isolated and Distance Education",
                       "St Mary MacKillop College": "St Mary Mackillop College"
                        }, inplace=True)

In [72]:
# merge hs_wa_2017 with icsea_full
hs_wa_2017_merge = pd.merge(hs_wa_2017, icsea_full , on=['School'], how='left')
hs_wa_2017_merge

,School,Year,Rank,Postcode,State Overall Score,Total Enrolments,ICSEA
0,Perth Modern School,2017,1,6008,100,1371,1239
1,International School of Western Australia,2017,2,6015,100,270,1182
2,Hale School,2017,3,6019,100,1489,1165
3,Methodist Ladies' College,2017,4,6010,100,1151,1150
4,Christ Church Grammar School,2017,5,6010,100,1651,1180
...,...,...,...,...,...,...,...
84,Bruce Rock District High School,2017,85,6418,90,142,952
85,Ashdale Secondary College,2017,86,6065,90,1536,1030
86,St Mary Mackillop College,2017,87,6280,90,1252,1045
87,Ellenbrook Christian College,2017,88,6069,90,553,1043
88,Margaret River Senior High School,2017,89,6285,90,991,1037

In [73]:
# Check for NaN values
# creating bool series True for NaN values  
bool_series = pd.isnull(hs_wa_2017_merge["ICSEA"])  
    
# filtering data  
# displaying data only with Gender = NaN  
hs_wa_2017_merge[bool_series]

Empty DataFrame
Columns: [School, Year, Rank, Postcode, State Overall Score, Total Enrolments, ICSEA]
Index: []

In [74]:
# merge hs_wa_2017_merge with school_coord
hs_wa_2017_coord = pd.merge(hs_wa_2017_merge, school_coord , on=['School'], how='left')
hs_wa_2017_coord

,School,Year,Rank,Postcode,State Overall Score,Total Enrolments,ICSEA,Longitude,Latitude
0,Perth Modern School,2017,1,6008,100,1371,1239,115.836396,-31.945066
1,International School of Western Australia,2017,2,6015,100,270,1182,115.777620,-31.898500
2,Hale School,2017,3,6019,100,1489,1165,115.783783,-31.912322
3,Methodist Ladies' College,2017,4,6010,100,1151,1150,115.775540,-31.987012
4,Christ Church Grammar School,2017,5,6010,100,1651,1180,115.776987,-31.985461
...,...,...,...,...,...,...,...,...,...
84,Bruce Rock District High School,2017,85,6418,90,142,952,118.147663,-31.873635
85,Ashdale Secondary College,2017,86,6065,90,1536,1030,115.841495,-31.811623
86,St Mary Mackillop College,2017,87,6280,90,1252,1045,115.330251,-33.662607
87,Ellenbrook Christian College,2017,88,6069,90,553,1043,115.959178,-31.786783
88,Margaret River Senior High School,2017,89,6285,90,991,1037,115.074671,-33.954318

In [75]:
# Check for NaN values
# creating bool series True for NaN values  
bool_series = pd.isnull(hs_wa_2017_coord["Longitude"])  
    
# filtering data  
# displaying data only with Gender = NaN  
hs_wa_2017_coord[bool_series]

Empty DataFrame
Columns: [School, Year, Rank, Postcode, State Overall Score, Total Enrolments, ICSEA, Longitude, Latitude]
Index: []

In [76]:
# merge hs_wa_2017_coord with sectors
wa_hs_icsea_2017 = pd.merge(hs_wa_2017_coord, sectors , on=['School'], how='left')
wa_hs_icsea_2017

,School,Year,Rank,Postcode,State Overall Score,Total Enrolments,ICSEA,Longitude,Latitude,Sector,Gender,Religion
0,Perth Modern School,2017,1,6008,100,1371,1239,115.836396,-31.945066,Government,Co-ed,Secular
1,International School of Western Australia,2017,2,6015,100,270,1182,115.777620,-31.898500,Government,Co-ed,Secular
2,Hale School,2017,3,6019,100,1489,1165,115.783783,-31.912322,Non-government,Boys,Anglican
3,Methodist Ladies' College,2017,4,6010,100,1151,1150,115.775540,-31.987012,Non-government,Girls,Methodist
4,Christ Church Grammar School,2017,5,6010,100,1651,1180,115.776987,-31.985461,Non-government,Boys,Anglican
...,...,...,...,...,...,...,...,...,...,...,...,...
84,Bruce Rock District High School,2017,85,6418,90,142,952,118.147663,-31.873635,Government,Co-ed,Secular
85,Ashdale Secondary College,2017,86,6065,90,1536,1030,115.841495,-31.811623,Government,Co-ed,Secular
86,St Mary Mackillop College,2017,87,6280,90,1252,1045,115.330251,-33.662607,Non-government,Co-ed,Catholic
87,Ellenbrook Christian College,2017,88,6069,90,553,1043,115.959178,-31.786783,Non-government,Co-ed,Christian
88,Margaret River Senior High School,2017,89,6285,90,991,1037,115.074671,-33.954318,Government,Co-ed,Secular

In [77]:
# Check for NaN values
# creating bool series True for NaN values  
bool_series = pd.isnull(wa_hs_icsea_2017["Sector"])  
    
# filtering data  
# displaying data only with Gender = NaN  
wa_hs_icsea_2017[bool_series]

Empty DataFrame
Columns: [School, Year, Rank, Postcode, State Overall Score, Total Enrolments, ICSEA, Longitude, Latitude, Sector, Gender, Religion]
Index: []

In [78]:
# save the wa_hs_icsea_2017 dataframe to a CSV file
wa_hs_icsea_2017.to_csv("Resources/wa_hs_icsea_2017.csv", index = False)

In [79]:
# get the 2016 url WA school ranking
rank_2016 = "https://bettereducation.com.au/school/secondary/wa/wa_top_secondary_schools.aspx?yr=2016"

# Use panda's `read_html` to parse the s1 url
hs_wa_2016 = pd.read_html(rank_2016, header=0)[0]

# insert a column 'year' with values of '2016'
hs_wa_2016.insert(1, 'Year', 2016)

# insert a column 'Rank' with values of incremental values'
hs_wa_2016.insert(2, 'Rank', range(1, 1 + len(hs_wa_2016)))

# Remove other strings after a comma to show only the school name
hs_wa_2016["School"] = hs_wa_2016["School"].str.split(',', 1).str.get(0)

# Remove the space and parenthesis strings to show only the school name
hs_wa_2016["School"] = hs_wa_2016["School"].str.split('\s+\(', 1).str.get(0)

# remove other columns
hs_wa_2016 = hs_wa_2016[['School', 'Year', 'Rank', 'Postcode','State Overall Score', 'Total Enrolments']]
hs_wa_2016

,School,Year,Rank,Postcode,State Overall Score,Total Enrolments
0,Perth Modern School,2016,1,6008,100,1336
1,Christ Church Grammar School,2016,2,6010,100,1663
2,International School of Western Australia,2016,3,6015,100,235
3,Hale School,2016,4,6019,100,1486
4,St Mary's Anglican Girls' School,2016,5,6018,99,1385
...,...,...,...,...,...,...
67,Bunbury Catholic College,2016,68,6230,91,1370
68,St Norbert College,2016,69,6107,90,890
69,Kalbarri District High School,2016,70,6536,90,220
70,Tranby College,2016,71,6171,90,884
71,Denmark Senior High School,2016,72,6333,90,401

In [80]:
# replace some values to correct the spelling
hs_wa_2016["School"].replace({"John Curtin College Of The Arts": "John Curtin College of the Arts", 
                       "Australian Christian College": "Australian Christian College - Southlands",
                       "St Stephen's School": "St Stephen's School - Duncraig",
                       "Schools Of Isolated & Distance Education": "School of Isolated and Distance Education",
                       "St Mary MacKillop College": "St Mary Mackillop College"
                        }, inplace=True)

In [81]:
# merge hs_wa_2016 with icsea_full
hs_wa_2016_merge = pd.merge(hs_wa_2016, icsea_full , on=['School'], how='left')
hs_wa_2016_merge

,School,Year,Rank,Postcode,State Overall Score,Total Enrolments,ICSEA
0,Perth Modern School,2016,1,6008,100,1336,1239
1,Christ Church Grammar School,2016,2,6010,100,1663,1180
2,International School of Western Australia,2016,3,6015,100,235,1182
3,Hale School,2016,4,6019,100,1486,1165
4,St Mary's Anglican Girls' School,2016,5,6018,99,1385,1158
...,...,...,...,...,...,...,...
67,Bunbury Catholic College,2016,68,6230,91,1370,1035
68,St Norbert College,2016,69,6107,90,890,1044
69,Kalbarri District High School,2016,70,6536,90,220,988
70,Tranby College,2016,71,6171,90,884,1066
71,Denmark Senior High School,2016,72,6333,90,401,1038

In [82]:
# Check for NaN values
# creating bool series True for NaN values  
bool_series = pd.isnull(hs_wa_2016_merge["ICSEA"])  
    
# filtering data  
# displaying data only with Gender = NaN  
hs_wa_2016_merge[bool_series]

Empty DataFrame
Columns: [School, Year, Rank, Postcode, State Overall Score, Total Enrolments, ICSEA]
Index: []

In [83]:
# merge hs_wa_2016_merge with school_coord
hs_wa_2016_coord = pd.merge(hs_wa_2016_merge, school_coord , on=['School'], how='left')
hs_wa_2016_coord

,School,Year,Rank,Postcode,State Overall Score,Total Enrolments,ICSEA,Longitude,Latitude
0,Perth Modern School,2016,1,6008,100,1336,1239,115.836396,-31.945066
1,Christ Church Grammar School,2016,2,6010,100,1663,1180,115.776987,-31.985461
2,International School of Western Australia,2016,3,6015,100,235,1182,115.777620,-31.898500
3,Hale School,2016,4,6019,100,1486,1165,115.783783,-31.912322
4,St Mary's Anglican Girls' School,2016,5,6018,99,1385,1158,115.766244,-31.876971
...,...,...,...,...,...,...,...,...,...
67,Bunbury Catholic College,2016,68,6230,91,1370,1035,115.661424,-33.343422
68,St Norbert College,2016,69,6107,90,890,1044,115.940344,-32.004364
69,Kalbarri District High School,2016,70,6536,90,220,988,114.163881,-27.712788
70,Tranby College,2016,71,6171,90,884,1066,115.800243,-32.340570
71,Denmark Senior High School,2016,72,6333,90,401,1038,117.364584,-34.957414

In [84]:
# Check for NaN values
# creating bool series True for NaN values  
bool_series = pd.isnull(hs_wa_2016_coord["Longitude"])  
    
# filtering data  
# displaying data only with Gender = NaN  
hs_wa_2016_coord[bool_series]

Empty DataFrame
Columns: [School, Year, Rank, Postcode, State Overall Score, Total Enrolments, ICSEA, Longitude, Latitude]
Index: []

In [85]:
# merge hs_wa_2016_coord with sectors
wa_hs_icsea_2016 = pd.merge(hs_wa_2016_coord, sectors , on=['School'], how='left')
wa_hs_icsea_2016

,School,Year,Rank,Postcode,State Overall Score,Total Enrolments,ICSEA,Longitude,Latitude,Sector,Gender,Religion
0,Perth Modern School,2016,1,6008,100,1336,1239,115.836396,-31.945066,Government,Co-ed,Secular
1,Christ Church Grammar School,2016,2,6010,100,1663,1180,115.776987,-31.985461,Non-government,Boys,Anglican
2,International School of Western Australia,2016,3,6015,100,235,1182,115.777620,-31.898500,Government,Co-ed,Secular
3,Hale School,2016,4,6019,100,1486,1165,115.783783,-31.912322,Non-government,Boys,Anglican
4,St Mary's Anglican Girls' School,2016,5,6018,99,1385,1158,115.766244,-31.876971,Non-government,Girls,Anglican
...,...,...,...,...,...,...,...,...,...,...,...,...
67,Bunbury Catholic College,2016,68,6230,91,1370,1035,115.661424,-33.343422,Non-government,Co-ed,Catholic
68,St Norbert College,2016,69,6107,90,890,1044,115.940344,-32.004364,Non-government,Co-ed,Catholic
69,Kalbarri District High School,2016,70,6536,90,220,988,114.163881,-27.712788,Government,Co-ed,Secular
70,Tranby College,2016,71,6171,90,884,1066,115.800243,-32.340570,Non-government,Co-ed,Uniting
71,Denmark Senior High School,2016,72,6333,90,401,1038,117.364584,-34.957414,Government,Co-ed,Secular

In [86]:
# Check for NaN values
# creating bool series True for NaN values  
bool_series = pd.isnull(wa_hs_icsea_2016["Sector"])  
    
# filtering data  
# displaying data only with Gender = NaN  
wa_hs_icsea_2016[bool_series]

Empty DataFrame
Columns: [School, Year, Rank, Postcode, State Overall Score, Total Enrolments, ICSEA, Longitude, Latitude, Sector, Gender, Religion]
Index: []

In [87]:
# save the wa_hs_icsea_2016 dataframe to a CSV file
wa_hs_icsea_2016.to_csv("Resources/wa_hs_icsea_2016.csv", index = False)